app/Controllers/clienteController.php

SELECT *
FROM `tab_clientes`
WHERE `cliente_correo` = 'domingo@gmail.com'
 LIMIT 1
---
    }

    $model = new ClienteModel();
    $cliente = $model->where('cliente_correo', $data['cliente_correo'])->first();