app/Controllers/Home.php

SELECT `tab_juegos`.*, `tab_categoria`.`categoria_descripcion`
FROM `tab_juegos`
JOIN `tab_categoria` ON `tab_categoria`.`categoria_id` = `tab_juegos`.`categoria_id`
WHERE `tab_categoria`.`categoria_descripcion` = 'gift card'
AND `tab_juegos`.`juego_estado` = 1
---
    public function productosAside($nombreCategoria): string {
        $data['titulo'] = "Productos";
        $model = new JuegoModel();
        $data['productos'] = $model
        ->select('tab_juegos.*, tab_categoria.categoria_descripcion')
        ->join('tab_categoria', 'tab_categoria.categoria_id = tab_juegos.categoria_id')
        ->where('tab_categoria.categoria_descripcion', urldecode($nombreCategoria))
        ->where('tab_juegos.juego_estado', 1)
        ->findAll();