app/Controllers/Home.php

    public function producto(): string {
        $data['titulo'] = "Productos";
        $model = new JuegoModel();
        $data['productos'] = $model->findAll();
---
SELECT *
FROM `tab_juegos`