app/Controllers/juegoController.php

    public function registroProducto()
    {
        // Verificar si el usuario está logueado y es administrador
        if (! session()->get('isLoggedIn') || session()->get('perfil_id') != 1) {
            return redirect()->to('cliente/iniciarSesion');
        }
        $categoriaModel = new CategoriaModel();
        $data['categorias'] = $categoriaModel->findAll();
---
SELECT *
FROM `tab_categoria`

            ];

            $juego = new JuegoModel();
            $juego->insert($data);
---
INSERT INTO `tab_juegos` (`juego_nombre`, `juego_plataforma`, `juego_descripcion`, `juego_stock`, `juego_precio`, `juego_imagen`, `categoria_id`, `juego_estado`) VALUES ('the last of us', 'ps4', 'prueba activa', '5', '1000', '1749501484_1d8af9fcb005cfc4b249.png', '10', 1)

    public function listaProductos() {
        $juegoModel = new JuegoModel();
        $data['productos'] = $juegoModel
            ->join('tab_categoria', 'tab_categoria.categoria_id = tab_juegos.categoria_id')
            ->findAll();
---
SELECT *
FROM `tab_juegos`
JOIN `tab_categoria` ON `tab_categoria`.`categoria_id` = `tab_juegos`.`categoria_id`

    public function gestionarProducto() {
        $juegoModel = new JuegoModel();
        $data['productos'] = $juegoModel
            ->join('tab_categoria', 'tab_categoria.categoria_id = tab_juegos.categoria_id')
            ->findAll();
---
SELECT *
FROM `tab_juegos`
JOIN `tab_categoria` ON `tab_categoria`.`categoria_id` = `tab_juegos`.`categoria_id`

    public function editarJuego($id = null)
{
    $juegoModel = new JuegoModel();
    $categoriaModel = new CategoriaModel();

    $producto = $juegoModel->find($id);

    if (!$producto) {
        return redirect()->to('gestionar')->with('mensaje', 'Producto no encontrado.');
    }

    $data = [
        'producto' => $producto,
        'categorias' => $categoriaModel->findAll()
---
SELECT *
FROM `tab_juegos`
WHERE `tab_juegos`.`juego_id` = '17'
SELECT *
FROM `tab_categoria`