app/Controllers/ventaController.php

    public function ventasAdmin(): string {
        $data['titulo'] = "Ventas";

        $ventaModel = new VentaModel();

        $query = $ventaModel->builder()
            ->select('tab_ventas.ventas_id,
                    tab_ventas.ventas_fecha,
                    tab_clientes.cliente_nombre,
                    tab_clientes.cliente_apellido,
                    tab_clientes.cliente_dni,
                    tab_clientes.cliente_correo,
                    tab_clientes.cliente_pais,
                    tab_clientes.cliente_provincia,
                    tab_clientes.cliente_ciudad,
                    tab_clientes.cliente_telefono,
                    tab_detalleventa.juego_id,
                    tab_detalleventa.detalle_cantidad,
                    tab_detalleventa.detalle_precio,
                    tab_juegos.juego_nombre,
                    tab_juegos.juego_plataforma')
            ->join('tab_clientes', 'tab_clientes.cliente_id = tab_ventas.cliente_id')
            ->join('tab_detalleventa', 'tab_detalleventa.ventas_id = tab_ventas.ventas_id')
            ->join('tab_juegos', 'tab_juegos.juego_id = tab_detalleventa.juego_id')
            ->get();
---
SELECT `tab_ventas`.`ventas_id`, `tab_ventas`.`ventas_fecha`, `tab_clientes`.`cliente_nombre`, `tab_clientes`.`cliente_apellido`, `tab_clientes`.`cliente_dni`, `tab_clientes`.`cliente_correo`, `tab_clientes`.`cliente_pais`, `tab_clientes`.`cliente_provincia`, `tab_clientes`.`cliente_ciudad`, `tab_clientes`.`cliente_telefono`, `tab_detalleventa`.`juego_id`, `tab_detalleventa`.`detalle_cantidad`, `tab_detalleventa`.`detalle_precio`, `tab_juegos`.`juego_nombre`, `tab_juegos`.`juego_plataforma`
FROM `tab_ventas`
JOIN `tab_clientes` ON `tab_clientes`.`cliente_id` = `tab_ventas`.`cliente_id`
JOIN `tab_detalleventa` ON `tab_detalleventa`.`ventas_id` = `tab_ventas`.`ventas_id`
JOIN `tab_juegos` ON `tab_juegos`.`juego_id` = `tab_detalleventa`.`juego_id`