app/Models/juegoModel.php

    public function obtenerJuegosConCategoria()
    {
        return $this->select('tab_juegos.*, tab_categoria.categoria_descripcion')
                    ->join('tab_categoria', 'tab_categoria.categoria_id = tab_juegos.categoria_id')
                    ->where('tab_juegos.juego_estado', 1)
                    ->findAll();
---
SELECT `tab_juegos`.*, `tab_categoria`.`categoria_descripcion`
FROM `tab_juegos`
JOIN `tab_categoria` ON `tab_categoria`.`categoria_id` = `tab_juegos`.`categoria_id`
WHERE `tab_juegos`.`juego_estado` = 1